Documents/КорректировкаГрузовогоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаГрузовогоМеста</Name>
			<BasedOn>
				<xr:Item>Document.ГрузовоеМесто</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ГрузовоеМесто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВГрузоместе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ГрузовоеМесто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ГрузовоеМесто</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактуально_КорректировкаСборки</Name>
					<Comment>Документ неактуален вследствие корректировки сборки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаСборки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСборкиЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияСамовывоза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШКОбособленного</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиШтрихкода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодГрузовогоМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КорректировкаГрузовогоМеста/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+Шульман А. 24.09.2025 #UT10-5433  
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьКодыМаркировки(Отказ);  
	КонецЕсли;                    
	//-Шульман А. 24.09.2025 #UT10-5433  
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГрузовоеМесто") Тогда
		
		Организация = ДанныеЗаполнения.Ссылка.Сборка.Организация;
		
		Если ДанныеЗаполнения.Ссылка.Погружено 
			ИЛИ ДанныеЗаполнения.Ссылка.Неактуально_КорректировкаСборки 
			ИЛИ НЕ ДанныеЗаполнения.Ссылка.Проведен Тогда
			
			#Если Клиент Тогда
				СообщениеПользователю = "Ввод невозможен. Документ грузовое место";
				
				Если НЕ ДанныеЗаполнения.Ссылка.Проведен Тогда 
					СообщениеПользователю = СообщениеПользователю + " Не проведен !";  
				КонецЕсли;
				
				Если ДанныеЗаполнения.Ссылка.Погружено Тогда 
					СообщениеПользователю = СообщениеПользователю + " 'Погружен' !";  
				КонецЕсли;
				
				Если ДанныеЗаполнения.Ссылка.Неактуально_КорректировкаСборки Тогда 
					СообщениеПользователю = СообщениеПользователю + " 'Неактуален' !";  
				КонецЕсли;
				
				Предупреждение(СообщениеПользователю, 10, "ВНИМАНИЕ !");
			#КонецЕсли
			
			Возврат;
			
		КонецЕсли;		
		
		ГрузовоеМесто   = ДанныеЗаполнения.Ссылка;
		Организация     = ДанныеЗаполнения.Ссылка.Сборка.Организация;
		Контрагент      = ДанныеЗаполнения.Ссылка.Сборка.Контрагент;
		Грузополучатель = ДанныеЗаполнения.Ссылка.Сборка.Грузополучатель;
		
		Если ДанныеЗаполнения.Проведен Тогда
			
			ЗапросОтстаков = Новый Запрос;
			ЗапросОтстаков.УстановитьПараметр("ГрузовоеМесто", ГрузовоеМесто);
			ЗапросОтстаков.Текст =
			"ВЫБРАТЬ
			|	ГрузовоеМестоТовары.Номенклатура КАК Номенклатура,
			|	ГрузовоеМестоТовары.Количество КАК Количество,
			|	ГрузовоеМестоТовары.Заказ
			|ПОМЕСТИТЬ ТаблицаТоваров
			|ИЗ
			|	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
			|ГДЕ
			|	ГрузовоеМестоТовары.Ссылка = &ГрузовоеМесто
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КоректировкаГрузовогоМестаТовары.Номенклатура,
			|	КоректировкаГрузовогоМестаТовары.Количество * -1,
			|	КоректировкаГрузовогоМестаТовары.Заказ
			|ИЗ
			|	Документ.КорректировкаГрузовогоМеста.Товары КАК КоректировкаГрузовогоМестаТовары
			|ГДЕ
			|	КоректировкаГрузовогоМестаТовары.Ссылка.ГрузовоеМесто = &ГрузовоеМесто
			|	И КоректировкаГрузовогоМестаТовары.Ссылка.Проведен
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаТоваров.Номенклатура,
			|	СУММА(ТаблицаТоваров.Количество) КАК Количество,
			|	ТаблицаТоваров.Заказ
			|ПОМЕСТИТЬ ТаблицаИтогов
			|ИЗ
			|	ТаблицаТоваров КАК ТаблицаТоваров
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Заказ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаИтогов.Номенклатура,
			|	ТаблицаИтогов.Количество,
			|	ТаблицаИтогов.Заказ
			|ИЗ
			|	ТаблицаИтогов КАК ТаблицаИтогов
			|ГДЕ
			|	ТаблицаИтогов.Количество > 0";
			
			РезультатЗапросаОстатков = ЗапросОтстаков.Выполнить();
			
			Если НЕ РезультатЗапросаОстатков.Пустой() Тогда
				
				ВыборкаОстатков = РезультатЗапросаОстатков.Выбрать();
				
				Пока ВыборкаОстатков.Следующий() Цикл
					
					НоваяСтрока = Товары.Добавить();
					НоваяСтрока.Номенклатура = ВыборкаОстатков.Номенклатура; 
					НоваяСтрока.Заказ = ВыборкаОстатков.Заказ;
					НоваяСтрока.КоличествоВГрузоместе = ВыборкаОстатков.Количество;
					НоваяСтрока.Количество = ВыборкаОстатков.Количество;
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЕсли;  
		
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ГрузовоеМесто = Документы.ГрузовоеМесто.ПустаяСсылка();

КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("ЗаданиеНаКорректировкуГрузоместа", "Задание на корректировку ГМ");
	
	Возврат СтруктураМакетов;
	
КонецФункции 

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НеВыводитьДиалогВыбораОтветственного = Ложь, _Ответственный = Неопределено) Экспорт
	
	#Если Клиент Тогда
		Если ЭтоНовый() Тогда
			
			Предупреждение("Документ можно распечатать только после его записи");
			Возврат;
			
		ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
			
			Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
			Возврат;
			
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат;
		КонецЕсли; 
	#КонецЕсли
	
	ТабДокумент = Неопределено; 
	
	Если ИмяМакета = "ЗаданиеНаКорректировкуГрузоместа" Тогда		
		Документы.КорректировкаГрузовогоМеста.ПечатьЗаданияНаКорректировку(Ссылка,ИмяМакета);
	КонецЕсли; 
	
	Если ТабДокумент <> Неопределено Тогда 
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПроверитьКодыМаркировки(Отказ) Экспорт
	
	//+Шульман А. 24.09.2025 #UT10-5433    
	Если Не ЗначениеЗаполнено(ГрузовоеМесто.Сборка) Или КодыМаркировки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзКодыМаркировки.КодМаркировки
		|ПОМЕСТИТЬ ВТ_КодыМаркировки
		|ИЗ
		|	&тзКодыМаркировки КАК тзКодыМаркировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////   
		|ВЫБРАТЬ
		|	тзКодыМаркировки.КодМаркировки
		|ПОМЕСТИТЬ ВТ_КодыМаркировкиРТУ
		|ИЗ
		|	&тзКодыМаркировкиРТУ КАК тзКодыМаркировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КодыМаркировки.КодМаркировки
		|ИЗ
		|	ВТ_КодыМаркировки КАК ВТ_КодыМаркировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыМаркировкиРТУ КАК ВТ_КодыМаркировкиРТУ
		|		ПО ВТ_КодыМаркировки.КодМаркировки = ВТ_КодыМаркировкиРТУ.КодМаркировки
		|ГДЕ
		|	ВТ_КодыМаркировкиРТУ.КодМаркировки ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("тзКодыМаркировки", КодыМаркировки.Выгрузить());
	Запрос.УстановитьПараметр("тзКодыМаркировкиРТУ", ГрузовоеМесто.Сборка.КодыМаркировки.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		#Если Клиент Тогда
		Сообщить("Код маркировки " + Выборка.КодМаркировки + " отсутствует в грузовом месте");    
		#КонецЕсли
		Отказ = Истина;
		
	КонецЦикла;   
	//-Шульман А. 24.09.2025 #UT10-5433
	
КонецПроцедуры
